validation/CylinderRe30/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.1;
    }
    pFinal
    {
        $p;
        relTol  0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU
        tolerance       1e-8;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol  0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors         1;
    nCorrectors     2;
    pRefCell        0;
    pRefValue       0;
    pressureCorrection true;

    residualControl
    {
        p
        {
            tolerance   1e-3;
            relTol      0;
        }
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
    pressureCorrection true;

    residualControl
    {
        p 1e-6;
        U 1e-6;
    }
}


relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
    }
}

// ************************************************************************* //
